{
    "version": "https://jsonfeed.org/version/1",
    "title": "Signal Fires PDX",
    "description": "",
    "home_page_url": "https://signalfirespdx.com",
    "feed_url": "https://signalfirespdx.com/feed.json",
    "user_comment": "",
    "icon": "https://signalfirespdx.com/media/website/android-chrome-512x512-2.png",
    "author": {
        "name": "Signal Fires Admin"
    },
    "items": [
        {
            "id": "https://signalfirespdx.com/posts/deportation-machine-next-door/",
            "url": "https://signalfirespdx.com/posts/deportation-machine-next-door/",
            "title": "The Deportation Machine Next Door: Why Portland Needs to Revoke ICE&#x27;s Permit",
            "summary": "A lot of Portlanders know about the protests. They’ve seen the smoke,&hellip;",
            "content_html": "<p>A lot of Portlanders know about the protests. They’ve seen the smoke, read the headlines, and watched the footage. But what many still don’t realize is what happens inside that plain beige office building off Macadam, quietly sitting next to a K–8 school.</p><p>This is Portland’s field office for Immigration and Customs Enforcement, specifically its Enforcement and Removal Operations division. It’s where federal agents process the people they’ve arrested across Portland, often during early morning raids. Here, people are fingerprinted, interrogated, and handed over to the federal deportation system. From this office, ICE coordinates transfers to faraway detention centers like Tacoma and arranges flights to deport people out of the country entirely.</p><p>Governor Tina Kotek has defended the facility by stating that it isn’t a detention center. Technically, that’s true. There are no long-term holding cells here. But that framing hides the real function of the building. This is where people are processed into the deportation system. Agents conduct interrogations, issue removal orders, and coordinate transfers to distant detention centers and deportation flights. Families are still torn apart because of what happens inside these walls. Calling it “administrative” doesn’t make the harm any less real.</p><p>All of this is happening quietly in our city because we allow it.</p><p>The building doesn’t even belong to the federal government. It’s <strong>privately owned</strong> by a local company, <strong>4310 Building LLC</strong>, and leased to ICE through a contract with the U.S. General Services Administration. A private landlord profits by renting space for deportation operations inside Portland city limits.</p><p>The facility operates under a conditional use permit issued by Portland’s city government back in 2011. City Council still has the power to revoke that permit.</p><p>Many Portlanders are surprised to learn this. After all, we call ourselves a sanctuary city. But while we embrace that label, we’ve allowed a key hub of ICE’s deportation machine to operate right next to a K–8 school, The Cottonwood School of Civics and Science. Only a narrow bike path separates federal deportation operations from Portland kids playing at recess.</p><blockquote>\n<p>This isn’t hypothetical harm. It’s happening right here.</p></blockquote>\n<h2 id=\"so-much-violence\">So much violence</h2>\n<p>During recent ICE Out of Portland protests, federal officers deployed tear gas, pepper rounds, and other crowd-control munitions directly next to the school grounds. Swabs taken directly from the spent canisters were sent to a local lab for analysis. The lab confirmed the presence of HC gas, a military-grade chemical agent banned from use in war due to its long-term health risks, as documented in the video created by a local portlander below.</p><p>This isn’t the first time the school has been impacted. After returning to in-person classes following COVID closures in 2020, parents found spent tear gas canisters and rubber bullets scattered across their children’s playground, left behind from earlier federal crackdowns.</p><p>The harm extends beyond the schoolyard. Retired residents at nearby Mirabella had to modify their HVAC systems after toxic gas seeped indoors. A local nurse was shot in the eye with a “less-lethal” round fired by federal agents, a head-level shot that violates use-of-force guidelines. Many hoped these kinds of violent crackdowns wouldn’t happen here, but the infrastructure that enables them remains fully intact.</p><p>In some cases, protesters have been charged under <a href=\"../oregons-riot-law\">Oregon’s outdated riot statute</a>, a law originally passed during the reactionary backlash to the Civil Rights and Vietnam War protests of the 1960s. That law gives broad discretion to police and federal agents to escalate peaceful gatherings into “unlawful assemblies,” triggering aggressive force. The same vague law that was used to justify crackdowns downtown has now been used repeatedly to target protests outside the ICE facility. Portlanders who show up peacefully are being criminalized for bearing witness.</p><blockquote>\n<p>This isn’t just about immigrants. It’s about all of us.</p></blockquote>\n<p>ICE has a long history of mistakenly deporting U.S. citizens due to paperwork errors, racial profiling, and bad information. Lives permanently upended because a federal bureaucracy made a mistake. The Portland office helps process the paperwork that makes those mistakes possible. This is not some faraway injustice. It is happening here.</p><p>As historian Adam Goodman documents in <a href=\"https://press.princeton.edu/books/hardcover/9780691182155/the-deportation-machine\">The Deportation Machine</a>, this kind of harm is not accidental; it’s the product of a system intentionally designed to spread enforcement across decentralized offices, paperwork pipelines, and private contractors, making accountability diffuse, while the human cost remains devastatingly concentrated.</p><p>Even elected officials are not immune. In both California and New York, Democratic lawmakers have been physically blocked, detained, or even tackled simply for trying to observe, ask questions, or advocate for their constituents during ICE enforcement actions. The message is clear: not even those we elect are safe from retaliation when they try to hold these operations accountable. As long as facilities like this remain embedded inside our cities, political violence isn’t hypothetical.  It’s part of the machinery.</p><h2 id=\"we-can-change-this\">We can change this</h2>\n<p>Other cities are already taking action. Portland can too.</p><p>Just last week, Glendale canceled its ICE contract. Newark is shutting down ICE operations due to permitting violations. These cities are drawing a line, not to end federal enforcement entirely, but to refuse complicity in an unjust system. Portland has that same legal authority. Revoking ICE’s conditional use permit wouldn’t make federal agents disappear, but it would make their operations here much harder.</p><p>A grassroots petition is already live, and it’s working.</p><p>As of today, nearly 12,000 Portlanders have signed the petition calling for City Council to revoke the permit. Political research shows it often only takes about 3.5% of a city’s population to create real pressure for policy change. In Portland, that’s around 21,000 signatures. We’re already more than halfway there.</p><p>This isn’t about left or right. It’s about what kind of city we want to live in. Do we allow a quiet deportation hub to operate in our neighborhoods, next to our schools? Or do we live up to the values of safety, fairness, and accountability we say we believe in?</p><blockquote>\n<p>Portland can make a different choice. But <strong>only if we act.</strong></p></blockquote>\n<p>If you want to learn more, you can read the petition here: <a href=\"https://campaigns.organizefor.org/petitions/revoke-the-permit-for-the-ice-detention-facility-in-portland\">Revoke ICE’s permit — Petition link</a>\nAnd watch this short explainer made by local Portlanders: <a href=\"https://youtu.be/W5bUkmjep3A?si=iwpAowL3ORVqFVpH\">Video explainer</a></p><p>Many of us have also stopped by the memorial growing outside the facility. Quietly reading the stories, placing flowers, and bearing witness. Every person who takes a moment to show up makes it harder to pretend this isn’t happening.</p><p>Solidarity makes Portland bloom.</p>",
            "author": {
                "name": "Signal Fires Admin"
            },
            "tags": [
            ],
            "date_published": "2025-06-18T14:26:59-07:00",
            "date_modified": "2025-06-18T17:22:50-07:00"
        },
        {
            "id": "https://signalfirespdx.com/posts/oregons-riot-law/",
            "url": "https://signalfirespdx.com/posts/oregons-riot-law/",
            "title": "Oregon’s Riot Law was Designed to Suppress Protest",
            "summary": "Oregon’s current riot law was born in a period of major political&hellip;",
            "content_html": "<p>Oregon’s current riot law was born in a period of major political upheaval. In the late 1960s and early 1970s, lawmakers across the country responded to the Civil Rights Movement and anti–Vietnam War protests by passing legislation that gave police broad authority to shut down demonstrations. Oregon was no exception.</p><p>More than 50 years later, that law remains on the books. It’s vague, overly broad, and prone to abuse.</p><h3 id=\"what-the-law-says\">What the Law Says</h3>\n<p>Under <a href=\"https://oregon.public.law/statutes/ors_166.015\">ORS 166.015</a>, a <strong>riot</strong> occurs when six or more people engage in “tumultuous and violent conduct” that creates a “grave risk of causing public alarm.”</p><p>But here’s the problem:</p><ul>\n<li>The term <strong>“tumultuous” is not defined</strong> in Oregon statute. It is left entirely to interpretation.</li>\n<li>Police <strong>do not need proof of actual violence</strong>. The law allows a riot declaration based on perceived risk or potential to cause public alarm.</li>\n<li>This means <strong>loud chanting, large crowds, or emotionally charged gatherings</strong> can be enough to trigger a riot declaration — even when nothing dangerous is actually happening.</li>\n</ul>\n<p>Once a riot is declared, officers are authorized to use force, including tear gas, rubber bullets, flashbangs, and mass detainment techniques. The <a href=\"https://www.aclu.org/know-your-rights/protesters-rights\">ACLU of Oregon explains these risks clearly in their Protester Rights guide</a>.</p><h3 id=\"why-this-law-still-matters\">Why This Law Still Matters</h3>\n<p>This law was crafted to control protests, not protect public safety. Its roots lie in a time when authorities were actively working to silence racial justice movements and anti-war voices. Today, it remains a tool that can be used to chill public dissent.</p><p>If a protest is simply loud or makes someone uncomfortable, that alone can legally justify escalation under current law. That undermines the constitutional right to free assembly and creates a chilling effect, especially for movements that already face discrimination.</p><p>Major media outlets have also highlighted these problems. In 2020, <a href=\"https://www.opb.org/article/2020/08/28/riot-unlawful-assembly-law-oregon-police-racism/\">OPB reported</a> that the laws governing riot declarations are vague and have roots in Oregon’s deeply racist past. As State Rep. Janelle Bynum explained, much of Oregon’s riot and crowd control statutes were developed during the 1960s and 1970s while protests for Black civil rights were occurring in Portland. OPB documented how police declared riots on 23 occasions between May 29 and August 27, often for incidents as minor as water bottles being thrown or spray paint being used.</p><p>Similarly, <a href=\"https://www.npr.org/2020/08/27/906729976/police-declare-portland-protests-a-riot-but-this-definition-could-be-rooted-in-r\">NPR reported</a> that the legal definition of riot allows for wide discretion and disproportionately affects nonviolent protesters. Portland Police Deputy Chief Chris Davis admitted that deciding when enough “tumultuous” conduct has occurred to justify a riot declaration is ultimately subjective. Protesters like Folasade Ogunfiditimi described how quickly riots were declared, sometimes over minor or even trivial events, leading to unnecessary force being used indiscriminately against large crowds.</p><h3 id=\"examples-of-abuse\">Examples of Abuse</h3>\n<p><strong>June 2025, ICE Facility - “No Kings” Protest:</strong></p><ul>\n<li>Portland police and federal officers declared a riot at the ICE facility around 6:30 p.m. despite limited incidents of violence. The declaration enabled rapid escalation, with tear gas and flashbangs deployed almost immediately against largely peaceful demonstrators. Critics argue this premature declaration unnecessarily escalated tensions and infringed on First Amendment rights.</li>\n</ul>\n<p><strong>2020 George Floyd Protests:</strong></p><ul>\n<li>During months of protests in 2020, Portland police frequently declared riots after isolated incidents, such as minor property damage or confrontations involving small groups. Protesters were subjected to mass tear gas deployments, rubber bullets, and aggressive arrests even when large portions of the crowd remained peaceful.</li>\n<li>Federal agents, often in unmarked uniforms, detained protesters in unmarked vehicles without clear identification. This sparked national outrage, with Governor Kate Brown and Mayor Ted Wheeler condemning the tactics as abuses of power and attacks on democratic rights.</li>\n</ul>\n<p><strong>2018 Patriot Prayer Rallies:</strong></p><ul>\n<li>At several Patriot Prayer rallies and counter-protests, police were accused of declaring riots and deploying crowd-control munitions disproportionately against counter-protesters, raising concerns about selective enforcement and biased application of the riot law.</li>\n</ul>\n<p>Civil rights groups like the ACLU of Oregon have challenged these tactics in court, arguing that vague laws and aggressive enforcement tactics violate constitutional rights to free speech, assembly, and due process.</p><h3 id=\"what-needs-to-change\">What Needs to Change</h3>\n<p>We urgently need clarity, accountability, and civil liberties protection:</p><ol>\n<li>Remove vague terms like <strong>“tumultuous”</strong> or define them with clear, objective standards.</li>\n<li>Require documented evidence of violence or an imminent threat before force is authorized.</li>\n<li>Establish independent oversight over riot declarations and crowd-control decisions.</li>\n<li>Strengthen legal protections for peaceful protest and public assembly.</li>\n</ol>\n<h3 id=\"we-deserve-better\">We Deserve Better</h3>\n<p>A functioning democracy requires more than the right to vote. It depends on the freedom to speak, gather, and demand change. Oregonians deserve a legal framework that protects those rights — not one that treats peaceful protest as a threat.</p><p><strong>It’s time to update Oregon’s riot law.</strong></p>",
            "author": {
                "name": "Signal Fires Admin"
            },
            "tags": [
            ],
            "date_published": "2025-06-16T16:00:00-07:00",
            "date_modified": "2025-06-18T17:20:04-07:00"
        }
    ]
}
